{
  "meta": {
    "title.index": "BlueBits Software – Xây dựng phần mềm đáng tin cậy cho các hệ thống phức tạp",
    "title.services": "Dịch vụ BlueBits – Dịch vụ kỹ thuật được xây dựng cho độ tin cậy và quy mô",
    "title.tools": "Công cụ & Thư viện BlueBits – Các dự án mã nguồn mở cho nhà phát triển",
    "title.blog": "Blog BlueBits – Ghi chú kỹ thuật, thử nghiệm & nghiên cứu sâu",
    "title.contact": "Liên hệ BlueBits – Trò chuyện với những người sáng lập"
  },
  "nav": {
    "brand": "BlueBits",
    "services": "Dịch vụ",
    "tools": "Công cụ & Thư viện",
    "blog": "Blog",
    "contact": "Liên hệ"
  },
  "index": {
    "hero.kicker": "Studio phần mềm",
    "hero.title": "Xây dựng phần mềm đáng tin cậy cho các hệ thống phức tạp.",
    "hero.subtitle": "Chúng tôi thiết kế các công cụ, thư viện và ứng dụng được tối ưu hóa cho hiệu suất, sự rõ ràng và khả năng bảo trì lâu dài.",
    "hero.actions.services": "Dịch vụ của chúng tôi",
    "hero.actions.tools": "Khám phá công cụ",
    "capabilities.title": "Năng lực",
    "capabilities.subtitle": "Các lĩnh vực cốt lõi nơi BlueBits mang lại giá trị kỹ thuật lâu dài.",
    "capabilities.backend.title": "Backend hiệu năng cao",
    "capabilities.backend.text": "Xây dựng các giải pháp và hệ thống phía máy chủ hiệu quả, có khả năng mở rộng, nơi độ trễ, thông lượng và độ tin cậy thực sự quan trọng.",
    "capabilities.backend.meta": "C++ · Rust · Hệ thống phân tán",
    "capabilities.devops.title": "DevOps & Hạ tầng",
    "capabilities.devops.text": "Đường ống CI/CD, hạ tầng dưới dạng mã (IaC), khả năng quan sát và tự động hóa nền tảng được điều chỉnh cho sản phẩm và đội ngũ của bạn.",
    "capabilities.devops.meta": "Kubernetes · Terraform · GitHub Actions",
    "capabilities.tooling.title": "Công cụ cho nhà phát triển",
    "capabilities.tooling.text": "Các công cụ và thư viện mã nguồn mở giúp loại bỏ rào cản khỏi quy trình làm việc phát triển hàng ngày.",
    "capabilities.tooling.meta": "CLI · Thư viện · Tự động hóa"
  },
  "services": {
    "hero.kicker": "Dịch vụ",
    "hero.title": "Dịch vụ kỹ thuật được xây dựng cho độ tin cậy và quy mô.",
    "hero.subtitle": "Từ tự động hóa cloud-native đến cấp phép bảo mật bằng mật mã và đường ống tài liệu, BlueBits giúp các đội ngũ triển khai các hệ thống sản xuất mạnh mẽ.",
    "offer.title": "Những gì chúng tôi cung cấp",
    "offer.subtitle": "Ba mảng dịch vụ thương mại được thiết kế xoay quanh các nhu cầu thực tế thường xuyên.",
    "track.devops.title": "DevOps, CI & Hạ tầng",
    "track.devops.text": "Thiết kế và triển khai các đường ống CI/CD có khả năng mở rộng, các tiêu chuẩn hạ tầng dưới dạng mã, điều phối môi trường và khả năng quan sát cho các đội ngũ hiện đại.",
    "track.devops.item1": "Tạo & tăng cường bảo mật CI/CD",
    "track.devops.item2": "Tiêu chuẩn hạ tầng Terraform / Pulumi",
    "track.devops.item3": "Cụm Kubernetes, tự động mở rộng & chiến lược triển khai",
    "track.devops.diagram.code": "Mã",
    "track.devops.diagram.build": "Xây dựng",
    "track.devops.diagram.test": "Kiểm thử",
    "track.devops.diagram.image": "Hình ảnh",
    "track.devops.diagram.deploy": "Triển khai",
    "track.devops.diagram.observe": "Quan sát",
    "track.license.title": "Máy chủ cấp phép (Mật mã DSA)",
    "track.license.text": "Kiến trúc và triển khai các máy chủ cấp phép sử dụng chữ ký DSA bất đối xứng để xác thực giấy phép ứng dụng cả trực tuyến và ngoại tuyến.",
    "track.license.item1": "Quản lý khóa & quy trình ký",
    "track.license.item2": "Xác thực giấy phép có khả năng ngoại tuyến",
    "track.license.item3": "SDK tích hợp & ứng dụng mẫu",
    "track.license.diagram.server": "Máy chủ",
    "track.license.diagram.signed": "Giấy phép đã ký",
    "track.license.diagram.client": "Khách hàng",
    "track.license.diagram.public": "Khóa công khai",
    "track.license.diagram.verify": "Xác thực",
    "track.license.diagram.access": "Truy cập",
    "track.ai.title": "Dịch thuật tài liệu hỗ trợ bởi AI",
    "track.ai.text": "Đường ống đầu cuối để dịch các tài liệu kỹ thuật và kinh doanh bằng cách sử dụng hỗ trợ của AI, với các giai đoạn xem xét và phê duyệt xác định.",
    "track.ai.item1": "Tiếp nhận & phân đoạn tài liệu",
    "track.ai.item2": "Bản dịch nháp bằng AI với các gợi ý tùy chỉnh",
    "track.ai.item3": "Xem xét và xuất bản với sự tham gia của con người",
    "track.ai.diagram.source": "Tài liệu nguồn",
    "track.ai.diagram.draft": "Nháp AI",
    "track.ai.diagram.review": "Xem xét",
    "track.ai.diagram.final": "Xuất bản cuối"
  },
  "tools": {
    "hero.kicker": "Mã nguồn mở",
    "hero.title": "Công cụ & thư viện xây dựng cho nhà phát triển.",
    "hero.subtitle": "Một bộ nhỏ các tiện ích miễn phí mà chúng tôi sử dụng trong công việc của chính mình—sẵn sàng để bạn fork, mở rộng và tích hợp vào quy trình làm việc của mình.",
    "projects.title": "Dự án",
    "projects.subtitle": "Mỗi dự án đi kèm với tài liệu, ví dụ và giấy phép mã nguồn mở cho phép.",
    "projects.note": "Các liên kết dưới đây trỏ đến các kho lưu trữ GitHub và bản tải xuống mẫu cho nguyên mẫu này.",
    "libbios.title": "libBIOS",
    "libbios.text": "Thư viện C++ đa nền tảng cung cấp quyền truy cập có cấu trúc vào các lệnh gọi BIOS cấp thấp và giao diện cho chẩn đoán và công cụ.",
    "libbios.meta": "C++ · cấp thấp · đa nền tảng",
    "libentropy.title": "libEntropy",
    "libentropy.text": "Tiện ích C++ đa nền tảng để ước tính entropy, giúp phát hiện các khối dữ liệu nén, mã hóa hoặc ngẫu nhiên trong các luồng dữ liệu lớn hơn.",
    "libentropy.meta": "C++ · entropy · phân tích",
    "codegen.title": "Trình tạo mã",
    "codegen.text": "Gói Python, CLI và thư viện sử dụng hỗ trợ AI để tạo DTO, kiểm thử và mã mẫu từ các mô tả giao diện dựa trên JSON.",
    "codegen.meta": "Python · CLI · hỗ trợ bởi AI",
    "nugetflow.title": "NugetFlow",
    "nugetflow.text": "Tiện ích DevOps để quản lý nguồn cấp dữ liệu gói NuGet, xuất bản và thăng tiến qua các môi trường, với các quy ước thân thiện với tự động hóa.",
    "nugetflow.meta": "DevOps · NuGet · đường ống",
    "versionflow.title": "VersionFlow",
    "versionflow.text": "Công cụ nhẹ để đánh số phiên bản, tạo nhật ký thay đổi và siêu dữ liệu phát hành, được tích hợp với các nhà cung cấp CI phổ biến và quy trình làm việc Git.",
    "versionflow.meta": "DevOps · đánh số phiên bản · phát hành",
    "links.github": "GitHub",
    "links.download": "Tải xuống",
    "links.pypi": "PyPI",
    "links.docs": "Tài liệu"
  },
  "blog": {
    "hero.kicker": "Blog",
    "hero.title": "Ghi chú kỹ thuật, thử nghiệm & nghiên cứu sâu.",
    "hero.subtitle": "Các bài tiểu luận ngắn gọn, thực tế về kỹ thuật hệ thống, phát triển phần mềm, quyền riêng tư kỹ thuật số và xây dựng các sản phẩm phần mềm đáng tin cậy.",
    "articles.title": "Các bài viết mới nhất",
    "articles.subtitle": "Hai bài viết mẫu để minh họa bố cục và phong cách.",
    "post1.meta": "15 tháng 4 · Bảo mật · Mật mã",
    "post1.title": "Sử dụng Thuật toán Chữ ký Số (DSA) để Xác thực Giấy phép",
    "post1.excerpt": "Cách các chữ ký bất đối xứng có thể giữ logic cấp phép của bạn ở phía khách hàng trong khi vẫn cho phép bạn duy trì toàn quyền kiểm soát các bản dựng nào được phép chạy. Chúng tôi đi sâu vào kiến trúc của một máy chủ cấp phép hỗ trợ DSA và thư viện xác thực.",
    "post2.meta": "28 tháng 3 · Quyền riêng tư · Bảo mật",
    "post2.title": "Chuyển sang các Dịch vụ Tôn trọng Quyền riêng tư, Zero-Knowledge",
    "post2.excerpt": "Một cách thực tế, nhẹ nhàng để chuyển từ các hệ sinh thái phổ biến như Google Drive, Dropbox và Evernote sang các dịch vụ áp dụng mã hóa zero-knowledge và giảm thiểu việc rò rỉ dữ liệu.",
    "links.read": "Đọc bài viết →"
  },
  "contact": {
    "hero.kicker": "Liên hệ",
    "hero.title": "Hãy cùng xây dựng điều gì đó đặc biệt.",
    "hero.subtitle": "Chúng tôi hợp tác với các startup, nhóm nghiên cứu và khách hàng doanh nghiệp trên toàn thế giới. Hãy liên hệ trực tiếp với những người sáng lập và chúng tôi sẽ phản hồi bạn.",
    "founders.title": "Người sáng lập",
    "founders.subtitle": "Hai nhà phát triển với hơn hai thập kỷ kinh nghiệm thực tế mỗi người.",
    "founder1.name": "Yurii Ch.",
    "founder1.role": "Phần mềm hệ thống & Hạ tầng",
    "founder1.bio": "Trong hơn 20 năm, Yurii đã chuyên về phần mềm hệ thống hiệu năng cao, runtime phân tán, kỹ thuật hạ tầng và tối ưu hóa cấp thấp cho các khối lượng công việc đòi hỏi khắt khe.",
    "founder2.name": "Yannick L.",
    "founder2.role": "Phát triển Fullstack",
    "founder2.bio": "Yannick mang đến hai thập kỷ kinh nghiệm fullstack sâu rộng trên các hệ sinh thái front-end, back-end và API—từ các sản phẩm giai đoạn đầu đến các nền tảng doanh nghiệp quy mô lớn.",
    "address.title": "Liên hệ & Địa chỉ",
    "address.email": "Email",
    "address.location": "Địa chỉ",
    "map.title": "Bản đồ",
    "map.placeholder": "Trình giữ chỗ bản đồ – nhúng nhà cung cấp bản đồ yêu thích của bạn tại đây."
  },
  "footer": {
    "index": "© 2025 BlueBits Software Studio. Tất cả các tên sản phẩm được sử dụng làm trình giữ chỗ cho nguyên mẫu.",
    "services": "© 2025 BlueBits Software Studio. Dịch vụ và mô tả là nội dung giữ chỗ cho nguyên mẫu.",
    "tools": "© 2025 BlueBits Software Studio. Tất cả các dự án được liệt kê ở đây là trình giữ chỗ cho bố cục.",
    "blog": "© 2025 BlueBits Software Studio. Các mục blog là nội dung giữ chỗ cho nguyên mẫu.",
    "contact": "© 2025 BlueBits Software Studio. Thông tin liên hệ là dữ liệu ví dụ cho nguyên mẫu."
  }
}
